<?php
return array(
    'calcByWeight' => array(99, 59,), // id категорий в которых доставка считается по весу
    'cars' => array(
        array(
            'name' => 'gazel', // идентификатор
            'title' => 'Газель', // название
            'volume' => 14, // объем
            'weight' => 2000, // вес
            'distance' => array( // цена от растояния
                0 => 42,
                300 => 45,
                1000 => 45,
                3000 => 55,
            ),
        ),
        array(
            'name' => 'bychok',
            'title' => 'Бычок',
            'volume' => 25,
            'weight' => 4000,
            'distance' => array(
                0 => 45,
                300 => 50,
                1000 => 50,
                3000 => 60,
            ),
        ),
        array(
            'name' => 'kamaz',
            'title' => 'Камаз',
            'volume' => 45,
            'weight' => 8000,
            'distance' => array(
                0 => 80,
                300 => 60,
                1000 => 60,
                3000 => 65,
            ),
        ),
        array(
            'name' => 'fura',
            'title' => 'Фура',
            'volume' => 90,
            'weight' => 20000,
            'distance' => array(
                0 => 100,
                300 => 75,
                1000 => 85,
                3000 => 105,
            ),
        ),
    ),
    'city' => array( // фиксированная стоимость доставки в города
        4851 => array( // id города таганрог
            'gazel' => 500, // стоитсть доставки в город
            'bychok' => 1000,
            'kamaz' => 4500,
            'fura' => 10000,
        ),
    ),
    'region' => array( // доставка в регионы
        4800 => array( // id региона Ростовская область
            'gazel' => 45, // стоитсть доставки в регионы за км
            'bychok' => 65,
            'kamaz' => 150,
            'fura' => 183,
        ),
        4312 => array( // id региона Московская область
            'gazel' => 42, // стоитсть доставки в регионы за км
            'bychok' => 45,
            'kamaz' => 55,
            'fura' => 70,
        ),
        4925 => array( // id региона Санкт Петербург и область
            'gazel' => 42, // стоитсть доставки в регионы за км
            'bychok' => 45,
            'kamaz' => 55,
            'fura' => 70,
        ),
        4503 => array( // id региона Новгородская область
            'gazel' => 45, // стоитсть доставки в регионы за км
            'bychok' => 55,
            'kamaz' => 65,
            'fura' => 75,
        ),
        3563 => array( // id региона Нижегородская область
            'gazel' => 45, // стоитсть доставки в регионы за км
            'bychok' => 55,
            'kamaz' => 65,
            'fura' => 75,
        ),
        3841 => array( // id региона Калужская область
            'gazel' => 37, // стоитсть доставки в регионы за км
            'bychok' => 40,
            'kamaz' => 55,
            'fura' => 70,
        ),
        5326 => array( // id региона Тульская область
            'gazel' => 37, // стоитсть доставки в регионы за км
            'bychok' => 40,
            'kamaz' => 55,
            'fura' => 70,
        ),
        3282 => array( // id региона Астраханская область
            'gazel' => 47, // стоитсть доставки в регионы за км
            'bychok' => 55,
            'kamaz' => 75,
            'fura' => 85,
        ),
        4227 => array( // id региона Липецкая область
            'gazel' => 37, // стоитсть доставки в регионы за км
            'bychok' => 40,
            'kamaz' => 55,
            'fura' => 70,
        ),
        5225 => array( // id региона Тамбовская область
            'gazel' => 42, // стоитсть доставки в регионы за км
            'bychok' => 50,
            'kamaz' => 65,
            'fura' => 85,
        ),
        4052 => array( // id региона Краснодарский край
            'gazel' => 42, // стоитсть доставки в регионы за км
            'bychok' => 50,
            'kamaz' => 65,
            'fura' => 85,
        ),
        5191 => array( // id региона Ставропольский край
            'gazel' => 42, // стоитсть доставки в регионы за км
            'bychok' => 50,
            'kamaz' => 65,
            'fura' => 85,
        ),
        3468 => array( // id региона Волгоградская область
            'gazel' => 42, // стоитсть доставки в регионы за км
            'bychok' => 50,
            'kamaz' => 67,
            'fura' => 75,
        ),
        5161 => array( // id региона Смоленская область
            'gazel' => 47, // стоитсть доставки в регионы за км
            'bychok' => 52,
            'kamaz' => 65,
            'fura' => 75,
        ),
        3503 => array( // id региона Вологодская область
            'gazel' => 42, // стоитсть доставки в регионы за км
            'bychok' => 50,
            'kamaz' => 67,
            'fura' => 75,
        ),
        4026 => array( // id региона Костромская область
            'gazel' => 42, // стоитсть доставки в регионы за км
            'bychok' => 50,
            'kamaz' => 67,
            'fura' => 95,
        ),
        3675 => array( // id региона Ивановская область
            'gazel' => 42, // стоитсть доставки в регионы за км
            'bychok' => 50,
            'kamaz' => 55,
            'fura' => 70,
        ),
        3371 => array( // id региона Брянская область
            'gazel' => 42, // стоитсть доставки в регионы за км
            'bychok' => 50,
            'kamaz' => 55,
            'fura' => 70,
        ),
        4969 => array( // id региона Саратовская область
            'gazel' => 45, // стоитсть доставки в регионы за км
            'bychok' => 50,
            'kamaz' => 57,
            'fura' => 70,
        ),
        4891 => array( // id региона Самарская область
            'gazel' => 45, // стоитсть доставки в регионы за км
            'bychok' => 50,
            'kamaz' => 57,
            'fura' => 70,
        ),
        5432 => array( // id региона Ульяновская область
            'gazel' => 45, // стоитсть доставки в регионы за км
            'bychok' => 50,
            'kamaz' => 60,
            'fura' => 75,
        ),
        5625 => array( // id региона Ярославская область
            'gazel' => 42, // стоитсть доставки в регионы за км
            'bychok' => 50,
            'kamaz' => 60,
            'fura' => 70,
        ),
        3437 => array( // id региона Владимирская область
            'gazel' => 42, // стоитсть доставки в регионы за км
            'bychok' => 50,
            'kamaz' => 60,
            'fura' => 70,
        ),
        4861 => array( // id региона Рязанская область
            'gazel' => 45, // стоитсть доставки в регионы за км
            'bychok' => 50,
            'kamaz' => 60,
            'fura' => 75,
        ),
        3784 => array( // id региона Тверская область
            'gazel' => 45, // стоитсть доставки в регионы за км
            'bychok' => 52,
            'kamaz' => 62,
            'fura' => 80,
        ),
        4657 => array( // id региона Пензенская область
            'gazel' => 42, // стоитсть доставки в регионы за км
            'bychok' => 50,
            'kamaz' => 62,
            'fura' => 80,
        ),
        7287 => array( // id региона Мордовия
            'gazel' => 45, // стоитсть доставки в регионы за км
            'bychok' => 52,
            'kamaz' => 65,
            'fura' => 85,
        ),
        5600 => array( // id региона Чувашия
            'gazel' => 45, // стоитсть доставки в регионы за км
            'bychok' => 52,
            'kamaz' => 65,
            'fura' => 85,
        ),
        4270 => array( // id региона Марий Эл
            'gazel' => 45, // стоитсть доставки в регионы за км
            'bychok' => 52,
            'kamaz' => 65,
            'fura' => 90,
        ),
        5246 => array( // id региона Татарстан
            'gazel' => 45, // стоитсть доставки в регионы за км
            'bychok' => 52,
            'kamaz' => 70,
            'fura' => 90,
        ),
        5404 => array( // id региона Удмуртия
            'gazel' => 45, // стоитсть доставки в регионы за км
            'bychok' => 52,
            'kamaz' => 70,
            'fura' => 90,
        ),
        4593 => array( // id региона Оренбург
            'gazel' => 42, // стоитсть доставки в регионы за км
            'bychok' => 52,
            'kamaz' => 70,
            'fura' => 90,
        ),
        3630 => array( // id региона Дагестан
            'gazel' => 47, // стоитсть доставки в регионы за км
            'bychok' => 57,
            'kamaz' => 75,
            'fura' => 97,
        ),
        5543 => array( // id региона Чечено ингушетия
            'gazel' => 45, // стоитсть доставки в регионы за км
            'bychok' => 57,
            'kamaz' => 75,
            'fura' => 97,
        ),
        3827 => array( // id региона Калмыкия
            'gazel' => 42, // стоитсть доставки в регионы за км
            'bychok' => 50,
            'kamaz' => 60,
            'fura' => 75,
        ),
        4773 => array( // id региона Псковская
            'gazel' => 45, // стоитсть доставки в регионы за км
            'bychok' => 52,
            'kamaz' => 60,
            'fura' => 75,
        ),

        4198 => array( // id региона Курская область
            'gazel' => 45, // стоитсть доставки в регионы за км
            'bychok' => 52,
            'kamaz' => 50,
            'fura' => 75,
        ),
        4633 => array( // id региона Орловская
            'gazel' => 45, // стоитсть доставки в регионы за км
            'bychok' => 52,
            'kamaz' => 60,
            'fura' => 75,
        ),
    ),
    'warehouse' => array(
        4848 => array( // Скалад в ростове
            'region' => array(
                5191 => array( // id региона Ставропольский край
                    'gazel' => 42, // стоитсть доставки в регионы за км
                    'bychok' => 50,
                    'kamaz' => 60,
                    'fura' => 70,
                ),
 4800 => array( // id региона Ростовская область
            'gazel' => 42, // стоитсть доставки в регионы за км
            'bychok' => 61,
            'kamaz' => 153,
            'fura' => 193,
        ),
            ),
            'city' => array( // фиксированная стоимость доставки в города
                4848 => array( // id города Ростов на Дону
                    'gazel' => 6000, // стоитсть доставки в город
                    'bychok' => 1500,
                    'kamaz' => 15000,
                    'fura' => 25000,
                ),
            ),
        )
    )
	  
);
